# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  0.369913 -0.021156  0.696865
c -0.663965 -1.656937 -0.283964
e  0.677063  0.100228 -0.316477
f  0.459468 -1.225327  0.152600
h  1.336427  0.448912 -2.725206

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  0.369913 -0.021156  0.696865  bar   True
c -0.663965 -1.656937 -0.283964  bar  False
e  0.677063  0.100228 -0.316477  bar   True
f  0.459468 -1.225327  0.152600  bar   True
h  1.336427  0.448912 -2.725206  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  0.369913 -0.021156  0.696865  bar   True
b       NaN       NaN       NaN  NaN    NaN
c -0.663965 -1.656937 -0.283964  bar  False
d       NaN       NaN       NaN  NaN    NaN
e  0.677063  0.100228 -0.316477  bar   True
f  0.459468 -1.225327  0.152600  bar   True
g       NaN       NaN       NaN  NaN    NaN
h  1.336427  0.448912 -2.725206  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [9]:
#### index row 'c' below
df2.loc[['c']]

        one       two     three four   five
c -0.663965 -1.656937 -0.283964  bar  False

In [10]:
#### index column 'two' below
df2['two']

a   -0.021156
b         NaN
c   -1.656937
d         NaN
e    0.100228
f   -1.225327
g         NaN
h    0.448912
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [11]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [12]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [13]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN -0.021156
c       NaN -1.656937
e       NaN  0.100228
f  0.459468 -1.225327
h  1.336427  0.448912

In [14]:
b = df[['one','two','three']]
b

        one       two     three
a  0.369913 -0.021156  0.696865
c -0.663965 -1.656937 -0.283964
e  0.677063  0.100228 -0.316477
f  0.459468 -1.225327  0.152600
h  1.336427  0.448912 -2.725206

In [15]:
a + b

        one  three       two
a       NaN    NaN -0.042311
c       NaN    NaN -3.313874
e       NaN    NaN  0.200456
f  0.918935    NaN -2.450653
h  2.672853    NaN  0.897823

In [16]:
b + a

        one  three       two
a       NaN    NaN -0.042311
c       NaN    NaN -3.313874
e       NaN    NaN  0.200456
f  0.918935    NaN -2.450653
h  2.672853    NaN  0.897823

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [17]:
a['one'].dropna()

f    0.459468
h    1.336427
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [18]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -0.021156
c -1.656937
e  0.100228
f -1.225327
h  0.448912

In [22]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -0.042311
c       NaN -3.313874
e       NaN  0.200456
f  0.918935 -2.450653
h  2.672853  0.897823

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [23]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN -0.042311
c       NaN -3.313874
e       NaN  0.200456
f  0.918935 -2.450653
h  2.672853  0.897823

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [24]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [25]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [26]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [27]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [37]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a       NaN       NaN -0.384621
b       NaN       NaN  0.982461
c  1.237474  0.605180 -0.269757
d  0.040936  0.572435 -0.887413
e -0.382902       NaN       NaN

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [38]:
#### insert your code here
rand_df['one']=rand_df['one'].fillna(1)
rand_df['two']=rand_df['two'].fillna(method = 'ffill')
rand_df['three']=rand_df['three'].fillna(method = 'bfill')
rand_df

a    0.000000
b    0.000000
c    1.237474
d    0.040936
e   -0.382902
Name: one, dtype: float64

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [ ]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

In [ ]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

In [ ]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

In [ ]:
df_filled = my_df.fillna(my_df.mean())
df_filled

In [ ]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.